export const categories = [
  {
    name: "整体风格",
    keywords: [
      "豪华",
      "运动",
      "复古",
      "现代简约",
      "越野",
      "环保",
      "高科技风格",
      "可爱",
      "艺术",
    ],
  },
  {
    name: "车窗",
    keywords: ["单门", "2门", "4门"],
  },
  {
    name: "车身造型",
    keywords: ["轿车", "SUV", "敞篷车", "皮卡", "超级跑车", "豪华车", "概念车"],
    subcategories: [
      {
        name: "轿车",
        subcategories: ["经典轿车", "运动轿车", "豪华轿车", "紧凑轿车"],
      },
      {
        name: "SUV",
        subcategories: ["豪华SUV", "越野SUV", "全尺寸SUV", "紧凑型SUV"],
      },
      {
        name: "敞篷车",
        subcategories: ["软顶敞篷车", "硬顶敞篷车"],
      },
      {
        name: "皮卡",
        subcategories: ["全尺寸皮卡", "中型皮卡", "豪华皮卡", "越野皮卡"],
      },
      {
        name: "超级跑车",
        subcategories: ["经典超级跑车", "现代超级跑车", "限量版超级跑车"],
      },
      {
        name: "豪华车",
        subcategories: ["传统豪华车", "现代豪华车", "豪华电动车", "豪华古典车"],
      },
      {
        name: "概念车",
        subcategories: [
          "无缝车体",
          "互动外表面",
          "碳纤维和复合材料",
          "车身线条锋利",
          "流畅的曲线",
        ],
      },
    ],
  },
  {
    name: "车身颜色",
    keywords: [
      "纯色",
      "珠光色",
      "金属色",
      "哑光色",
      "糖果色",
      "荧光色",
      "复古做旧",
      "渐变色",
      "镜面镀铬",
    ],
    subcategories: [
      {
        name: "纯色",
        subcategories: [
          "经典黑",
          "象牙白",
          "火焰红",
          "宝石蓝",
          "草坪绿",
          "太阳黄",
        ],
      },
      {
        name: "珠光色",
        subcategories: [
          "北极星白",
          "月光银",
          "珊瑚珠粉",
          "天际蓝",
          "翡翠绿",
          "紫罗兰",
        ],
      },
      {
        name: "金属色",
        subcategories: [
          "钛金属灰",
          "银河蓝",
          "青铜金属",
          "赛车绿",
          "宇宙黑",
          "熔岩橙",
        ],
      },
      {
        name: "哑光色",
        subcategories: [
          "战斗机灰",
          "潜水艇黄",
          "隐匿黑",
          "天空蓝",
          "沙漠棕",
          "浅石灰绿",
        ],
      },
      {
        name: "糖果色",
        subcategories: [
          "海洋蓝",
          "猩红红",
          "阳光橙",
          "翠绿",
          "皇家紫",
          "黄金黄",
        ],
      },
      {
        name: "荧光色",
        subcategories: [
          "电光蓝",
          "霓虹绿",
          "荧光粉",
          "荧光橙",
          "紫色闪电",
          "日光黄",
        ],
      },
      {
        name: "复古做旧",
        subcategories: [
          "老化青铜",
          "怀旧蓝",
          "复古米色",
          "旧金",
          "退色红",
          "经典银",
        ],
      },
      {
        name: "渐变色",
        subcategories: [
          "日出红",
          "海洋之蓝",
          "森林之绿",
          "天际之紫",
          "火山之灰",
          "热带之黄",
        ],
      },
      {
        name: "镜面镀铬",
        subcategories: [
          "光泽银",
          "闪电金",
          "彩虹铬",
          "天空反射蓝",
          "镜面黑",
          "红宝石镜面",
        ],
      },
    ],
    pathSave: true,
  },
  {
    name: "装饰条",
    keywords: [
      "镀铬",
      "碳纤维",
      "红色",
      "黑色",
      "白色",
      "银色",
      "金色",
      "彩色",
      "LED灯管",
    ],
  },

  {
    name: "轮毂尺寸",
    keywords: ["18寸", "20寸", "22寸", "28寸", "35寸（大脚怪）"],
  },
  {
    name: "轮毂设计",
    keywords: ["五辐设计", "多幅设计", "刀锋轮毂", "网状设计", "无条辐设计"],
  },
  {
    name: "轮毂颜色",
    keywords: [
      "红色",
      "黑色",
      "白色",
      "银色",
      "金色",
      "镀铬",
      "彩色",
      "碳纤维",
    ],
  },
  {
    name: "侧裙",
    keywords: ["小尺寸侧裙", "中等尺寸侧裙", "大尺寸侧裙"],
  },
  {
    name: "前唇",
    keywords: ["小尺寸前唇", "中等尺寸前唇", "大尺寸前唇"],
  },
  {
    name: "尾翼",
    keywords: ["小尺寸尾翼", "中等尺寸尾翼", "大尺寸尾翼"],
  },
  {
    name: "车顶选项",
    keywords: ["科技透明", "行李架", "正常", "气动车顶", "太阳能充电"],
  },
  {
    name: "前脸及格栅",
    keywords: ["大面积前格栅", "隐藏式格栅", "光学装饰格栅"],
  },
];
